Revit 2024 API
Polyloop Properties
The Polyloop type exposes the following members.
Properties
Name | Description
Centroid
 The polygon centroid.
Direction
 The direction for the outward normal for this polygon.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace